fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Договоры</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Создан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРеализации</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРеализации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонСуммаАбонПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонСтоимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Период) = Ложь Тогда
		ТекДата = ТекущаяДата();
		Объект.Период = НачалоМесяца(ДобавитьМесяц(ТекДата, -1));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте               
Процедура ЗаполнитьДоговоры(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		Предупреждение("Укажите период для формирования актов");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДоговорыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоговорыНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьДоговоры();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьАкты(Команда)
	
	Если Объект.Договоры.Количество() = 0 Тогда
		Предупреждение("Сначала заполните список договоров");
		Возврат;
	КонецЕсли;
	
	ЕстьНеСозданные = Ложь;
	Для Каждого СтрокаДоговор Из Объект.Договоры Цикл
		Если Не СтрокаДоговор.Создан Тогда
			ЕстьНеСозданные = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьНеСозданные Тогда
		Предупреждение("Все акты уже созданы");
		Возврат;
	КонецЕсли;
	
	ЗапуститьСозданиеАктовНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьСозданиеАктовНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Период = ОбработкаОбъект.Период;
	
	Результат = СоздатьДокументыДляАбонентскихДоговоров(Период);
	
	ОбработкаОбъект.Договоры.Очистить();
	
	Для Каждого ЭлементМассива Из Результат Цикл
		НоваяСтрока = ОбработкаОбъект.Договоры.Добавить();
		НоваяСтрока.Договор = ЭлементМассива.Договор;
		НоваяСтрока.Контрагент = ЭлементМассива.Контрагент;
		НоваяСтрока.Организация = ЭлементМассива.Организация;
		НоваяСтрока.ДокументРеализации = ЭлементМассива.ДокументРеализация;
		НоваяСтрока.Создан = ЭлементМассива.Создан;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры  

Функция СоздатьДокументыДляАбонентскихДоговоров(Знач Период, Знач Организация = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.Организация КАК Организация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ";

	Если Организация <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + " И ДоговорыКонтрагентов.Организация = &Организация";
		Запрос.УстановитьПараметр("Организация", Организация);
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Результат = Новый Массив;
	ДатаНачала = НачалоМесяца(Период);
	ДатаОкончания = КонецМесяца(Период);

	Пока Выборка.Следующий() Цикл

		ЗапросРеализации = Новый Запрос;
		ЗапросРеализации.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Договор = &Договор
		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И РеализацияТоваровУслуг.Проведен = ИСТИНА";

		ЗапросРеализации.УстановитьПараметр("Договор", Выборка.Договор);
		ЗапросРеализации.УстановитьПараметр("ДатаНачала", ДатаНачала);
		ЗапросРеализации.УстановитьПараметр("ДатаОкончания", ДатаОкончания);

		РезультатРеализации = ЗапросРеализации.Выполнить();
		ВыборкаРеализации = РезультатРеализации.Выбрать();

		Если ВыборкаРеализации.Следующий() Тогда
			НовыйДокумент = ВыборкаРеализации.Ссылка.ПолучитьОбъект();
		Иначе
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Дата = ДатаОкончания;
		КонецЕсли;

		НовыйДокумент.Организация = Выборка.Организация;
		НовыйДокумент.Контрагент = Выборка.Контрагент;
		НовыйДокумент.Договор = Выборка.Договор;
		НовыйДокумент.Комментарий = "Создан автоматически";
		НовыйДокумент.ВыполнитьАвтозаполнение();
		НовыйДокумент.Заполнить(Неопределено);

		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Договор", Выборка.Договор);
		СтруктураДанных.Вставить("Контрагент", Выборка.Контрагент);
		СтруктураДанных.Вставить("Организация", Выборка.Организация);
		СтруктураДанных.Вставить("ДокументРеализация", Неопределено);
		СтруктураДанных.Вставить("Создан", Ложь);
		СтруктураДанных.Вставить("Ошибка", "");

		Если НовыйДокумент.Услуги.Количество() > 0 Тогда
			Попытка
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
				СтруктураДанных.ДокументРеализация = НовыйДокумент.Ссылка;
				СтруктураДанных.Создан = Истина;
			Исключение
				СтруктураДанных.Ошибка = ОписаниеОшибки();
			КонецПопытки;
		Иначе
			СтруктураДанных.Ошибка = "Не заполнена табличная часть Услуги";
		КонецЕсли;

		Результат.Добавить(СтруктураДанных);

	КонецЦикла;

	Возврат Результат;

КонецФункции
